// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor).
// Скласти результат цих чисел в змінній result.
let mas = [1+20+3+70+5+6+7+8+9+10]
console.log(Math.floor(mas))


// 2. Створити об'єкт book з наступними полями
// - назва, кількість сторінок, жанр
let nem = ["Дон Кихот",350,"Фантастика"]
console.log (nem [0])
console.log (nem [1])
console.log (nem [2])


// Створити об'єкт book з наступними полями
// - назва, кількість сторінок, жанр, автори
let book = {
    name:"Назва книги - Дон Кихот",
    NumberOfPages:"Кількість сторінок - 350",
    Genre:"Жанр - фантастика",
    Authors:"Автори - Мигель де Сервантес",
}
console.log (book.name)
console.log (book.NumberOfPages)
console.log (book.Genre)
console.log (book.Authors)


// 4. Створити маисв об'єктів book з наступними полями
// - назва, кількість сторінок, жанр, автори.
// Вивести кожну книгу як окремий об'єкт




// 5. Напишіть код, який вираховує площу прямокутника висотою 23см.
// (змінна height) та шириною 10см (змінна width).
// // Значення площі зберігати в змінній s.
// let heinght = 23;
// let s = [heinght*10]
// console.log (s.)
let height = 23
let widt = 10
let s = (height*widt)
console.log(s)


// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та
// діаметром основи 4м (dC),результат помістіть у змінну v.
// Sпол = 2 * 3.14 * 4 + 2 * 3.14 * 4 * 10 = 25,12 + 251,2 = 276,32мм2
let heightC = 5
let S = [[2*3.14*4]+[2*3.14*4*heightC]]
console.log(s)



// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.
// pow (число, ступінь) або оператор зведення в ступінь **).
