// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
//
// let time = +prompt("напишіть число івд 1 до 59!")
// if (time >= 1 && time <= 15){
//     document.write("Це число відноситься до 1ї четверті!")
// } else if (time > 15 && time <= 30){
//     document.write("Це число відноситься до 2ї четверті!")
// }else if (time > 30 && time <= 45){
//     document.write("Це число відноситься до 3ї четверті!")
// }else if (time > 45 && time <= 59){
//     document.write("Це число відноситься до 4ї четверті!")
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = 25
// if (day >=1 && day <= 10){
//     document.write("це число потрапляє в 1 половину(декаду) місяця!")
// } else if(day > 10 && day <= 20){
//     document.write("це число потрапляє в 2 половину(декаду) місяця!")
// }  else if(day > 20 && day <= 31){
//     document.write("це число потрапляє в 3 половину(декаду) місяця!")
// }


// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// let test = true
// if (test === true) {
//     document.write('Вірно')
// } else {
//     document.write('Неправильно')
// }

// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
// let test = true
//
// test === true
//     ? document.write('Вірно')
//     : document.write('Неправильно')


// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let a = 0
// if (a !== 0){
//     document.write("Невірно")
// } else {
//     document.write('Невірно')
// }


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
// let d = +prompt('Який сьогодні день тижня?')
// switch (d) {
//     case 1:
//         console.log('7 уроків')
//         break
//     case 2:
//         console.log('5 уроків')
//         break
//     case 3:
//         console.log('9 уроків')
//         break
//     case 4:
//         console.log('7 уроків')
//         break
//     case 5:
//         console.log('5 уроків')
//         break
//     case 6:
//         console.log('Вихіжний')
//         break
//     case 7:
//         console.log('Вихіжний')
//         break
//     default:
//         console.log('Error')
// }


// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
// let year = +prompt('write a year')
//
// if (year % 4 === 0) {
//     console.log("високосний")
// } else {
//     console.log("невисокосний")
// }


// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
// let zzz = prompt(ведіть текст)
// if (zzz === "ECMAScript"){
//     console.log("Правильно!")
// } else {
//     console.log("Не знаєте? ECMAScript!")
// }